using System;
using System.Collections.Generic;
using System.Linq;
using System.Net;
using System.Net.Http;
using System.Web.Http;

namespace WJ.API.Controllers
{
    public class TestController : ApiController
    {
        [AllowAnonymous]
        [HttpGet]
        public IHttpActionResult Test1(string id)
        {
            string result = "";

            if(string.IsNullOrWhiteSpace(id))
            {
                result = "[{\"x\": \"2月\",\"y\": \"235.5\",\"z\": \"0\"},{\"x\": \"3月\",\"y\": \"156.3\",\"z\": \"-33.6\"},{\"x\": \"4月\",\"y\": \"123.5\",\"z\": \"-21\"},{\"x\": \"5月\",\"y\": \"423.5\",\"z\": \"42.9\"},{\"x\": \"6月\",\"y\": \"456.5\",\"z\": \"7.8\"},{\"x\": \"7月\",\"y\": \"356.5\",\"z\": \"-21.9\"},{\"x\": \"8月\",\"y\": \"456.5\",\"z\": \"28.1\"},{\"x\": \"9月\",\"y\": \"853.5\",\"z\": \"87\"},{\"x\": \"10月\",\"y\": \"456.5\",\"z\": \"28.1\"},{\"x\": \"11月\",\"y\": \"456.5\",\"z\": \"28.1\"},{\"x\": \"12月\",\"y\": \"456.5\",\"z\": \"28.1\"}]";
            }
            else
            {
                result = "[{\"x\": \"2月\",\"y\": \"1000\",\"z\": \"0\"},{\"x\": \"3月\",\"y\": \"156.3\",\"z\": \"-33.6\"},{\"x\": \"4月\",\"y\": \"123.5\",\"z\": \"-21\"},{\"x\": \"5月\",\"y\": \"423.5\",\"z\": \"42.9\"},{\"x\": \"6月\",\"y\": \"456.5\",\"z\": \"7.8\"},{\"x\": \"7月\",\"y\": \"356.5\",\"z\": \"-21.9\"},{\"x\": \"8月\",\"y\": \"456.5\",\"z\": \"28.1\"},{\"x\": \"9月\",\"y\": \"853.5\",\"z\": \"87\"},{\"x\": \"10月\",\"y\": \"456.5\",\"z\": \"28.1\"},{\"x\": \"11月\",\"y\": \"456.5\",\"z\": \"28.1\"},{\"x\": \"12月\",\"y\": \"456.5\",\"z\": \"28.1\"}]";
            }

            return Json<dynamic>(Newtonsoft.Json.JsonConvert.DeserializeObject(result));
        }
    }
}
